microchip-pic-avr-examples/pic16f18076-calculating-pulse-and-duty-cycle-mplab-melody/pic16f18076-calculating-pulse-and-duty-cycle-mplab-melody.X/IOC_w_Timer.c
/*
 * File:   IOC_w_Timer.c
 * Author: C63290
 *
 * Created on November 15, 2022, 10:32 AM
 */


#include <xc.h>
#include "IOC_w_TIMER.h"
#include "Basic_Init.h"
#include "mcc_generated_files/system/system.h"




void IOC_w_Timer_Calculations(void){
    IOC_w_Timer_Initialize();
    uint24_t pulse_count = 0;
    uint24_t period_count = 0;
    uint8_t period_countH = 0;
    uint8_t period_countL = 0;
    uint8_t pulse_countH = 0;
    uint8_t pulse_countL = 0;
    uint8_t duty_cycle = 0;
    IOCBFbits.IOCBF5 = 0;
    TMR0L = 0;
    TMR0H = 0;

    while(PORTBbits.RB5 == LOW);
    while(PORTBbits.RB5 == HIGH);
    IOCBFbits.IOCBF5 = 0;
    while(!IOCBFbits.IOCBF5);
    while(IOCBFbits.IOCBF5)
    {
        IOCBFbits.IOCBF5 = 0;
        Timer0_Start();
        while(!IOCBFbits.IOCBF5);
        IOCBFbits.IOCBF5 = 0;
        Timer0_Stop();
        pulse_count = Timer0_Read();
        Timer0_Start();
        while(!IOCBFbits.IOCBF5);
        IOCBFbits.IOCBF5 = 0;
        Timer0_Stop();
        period_count = Timer0_Read();
    }
        
        //pulse_count = 0x12;
        //period_count = 0x36;
        //period_count = period_count + pulse_count;
        
        period_countH = (period_count & 0xFF00) >> 8;
        period_countL = (period_count & 0xFF);
        pulse_countH = (pulse_count & 0xFF00) >> 8;
        pulse_countL = (pulse_count & 0xFF);
        
        duty_cycle = (pulse_count << 8)/ period_count;
        
        EUSART1_sendAllData(pulse_countH, pulse_countL, period_countH, period_countL, duty_cycle);

        pulse_count = 0;
        period_count = 0;
        TMR0L = 0;
        TMR0H = 0;

        __delay_ms(1);

    IOC_Reset();
    TMR0_Reset();
}
